
import openpyxl
from workers import ROR


def insert_data_to_excel(file_name, data_dict, sheet_name):
    try:
        workbook = openpyxl.load_workbook(file_name, keep_vba=True)
        for i in workbook.sheetnames:
            print(i)
    except FileNotFoundError:
        workbook = openpyxl.Workbook()

    worksheet = workbook[sheet_name] # Получение листа
    
    # Соответствие ключей словаря ячейкам
    cell_mapping = {}

    if sheet_name == '1':
        mark = ()
        cell_mapping = {
            "председатель": "B15",
            "член_ком1": "B20",
            "рп": "B22",
        }
    elif sheet_name == '2':
        mark = (
                'E15', 'E16', 'E17', 'E19', 'E20', 'E21', 'F23', 'H23','E20', 'F24','H24', 'F25','H25', 'F27','H27',
                'F28', 'H28', 'E33','J33', 'E35','J35'
                )

        # 5. Право владения объектом, планируется  по Договору:
        if data_dict.get("право_владения") == "Аренда":
            pravo = "E15"
        elif data_dict.get("право_владения") == "Аренды (будущей вещи)":
            pravo = "E16"
        else:
            pravo = "E17"

        # 6. Планируемый объект является:
        if data_dict.get("собственность") == "Частная собственность":
            own = "E19"
        elif data_dict.get("собственность") == "Муниципальная собственность":
            own = "E20"
        else:
            own = "E21"

        # является памятником архитектуры
        if data_dict.get("памятник") == "Да":
            memorial = "F23"
        else:
            memorial = "H23"

        # Введено в эксплуатацию
        if data_dict.get("эксплуатация") == "Да":
            exploitation = "F24"
        else:
            exploitation = "H24"

        # признано ветхим/аварийным
        if data_dict.get("ветхость") == "Да":
            dilapidation = "F25"
        else:
            dilapidation = "H25"

        # цоколь
        if data_dict.get("цоколь") == "Да":
            base = "F27"
        else:
            base = "H27"    

        # один_собственник    
        if data_dict.get("один_собственник") == "Да":
            one_owner = "F28"
        else:
            one_owner = "H28"

        # Договору аренды будут оформлены  
        if data_dict.get("документы_подвала") == "Все помещения":
            basment_doc = "E33"
        else:
            basment_doc = "J33"

        # Основная ориентированность на   
        if data_dict.get("трафик") == "Пешеходный трафик":
            traffic = "E35"
        else:
            traffic = "J35"

        cell_mapping = {
            "адрес": "B6",
            "владелец": "B7",
            "контакты_владельца": "B8",
            "пользователь": "B10",
            "контакты_пользователя": "B11",
            "функциональное_назначение": "C13",
            "право_владения": pravo,
            "комментарии_1": "B18",
            "собственность": own,
            "комментарии_2": "B22",
            "памятник": memorial,
            "эксплуатация": exploitation,
            "ветхость": dilapidation,
            "комментарии_3": "B26",
            "цоколь": base,
            "один_собственник": one_owner,
            "комментарии_4": "B29",
            "подвальные_помещения": "C30",
            "документы_подвала": basment_doc,
            "комментарии_5": "B34",
            "трафик": traffic,
        }
    
    # Запись данных в ячейки
    for key, value in data_dict.items():
        if key in cell_mapping.keys():
            cell = cell_mapping[key]
            if value == 'Пропущено':
                pass
            else:
                if cell in mark and sheet_name == '2':
                    worksheet[cell] = 'X'
                else:
                    worksheet[cell] = value

    workbook.save(file_name) # Сохранение изменений
    print(f"Данные успешно вставлены в файл '{file_name}'.")


file = '../Объекты/2 СПБ ЛО, г.п. Ульяновка Калинина, д. 1/Акты/АПО/АПО СПБ ЛО, г.п. Ульяновка Калинина, д. 1.xlsm'
data = {'id': 1644147255, 'филиал': 'МСК', 'адрес': '154 МСК МО, Первомайское Фоминское 23б', 'рп': 'Соколов', 'председатель': 'Литвинов А. В.', 'член_ком1': 'Рябухин А. И.', 'владелец': 'bbdgfbdfg', 'контакты_владельца': 'aregerg', 'пользователь': 'gsrgsfvgxdf', 'контакты_пользователя': 'ulio,lhio,', 'функциональное_назначение': 'ikuiui,,', 'право_владения': 'Аренды (будущей вещи)', 'комментарии_1': ',i,i,hk', 'собственность': 'Государственная собственность', 'комментарии_2': 'iukyuikyui', 'памятник': 'Да', 'эксплуатация': 'Нет', 'ветхость': 'Да', 'комментарии_3': 'kuikuik', 'цоколь': 'Да', 'один_собственник': 'Нет', 'комментарии_4': 'kuikui', 'подвальные_помещения': 'Пропущено', 'документы_подвала': 'Не все помещения', 'комментарии_5': 'ikuikyui', 'трафик': 'Автомобильный трафик', 'площадь_помещения': '4564+', 'этаж': 'Пропущено', 'этажность': 'Пропущено', 'тип_объекта': 'Иные объекты', 'использование_подвала': 'Пропущено', 'комментарий_6': 'Пропущено', 'соответствие_планировки': 'Пропущено', 'комментарий_7': 'Пропущено', 'фундамент': 'Пропущено', 'полы': 'Пропущено', 'нагрузка': 'Пропущено', 'стены': 'Пропущено', 'тип_потолка': 'Пропущено', 'материал_потолка': 'Пропущено', 'тип_пола': 'Пропущено', 'материал_пола': 'Пропущено', 'кровля': 'Пропущено', 'конструктивная_схема': 'Пропущено', 'дефекты': 'Пропущено', 'проем': 'Пропущено', 'замена_элементов': 'Пропущено', 'площадь_реконструкции': 'Пропущено', 'пристройка': 'Пропущено', 'потолки': 'Пропущено', 'полы_объем': 'Пропущено', 'кровля_переустройство': 'Пропущено', 'тип_строительства': 'Пропущено', 'экспертиза': 'Пропущено', 'требования': 'Пропущено'}

insert_data_to_excel(file, data, '2')
